import pandas as pd

#==================================
# Модуль Аналізатора (Signal Provider)
#==================================

class Analyzer:

    #------------------------------
    # Ініціалізація
    #------------------------------

    def __init__(self, window_size: int = 1):
        """Параметри: window_size - розмір вікна даних, яке передається аналізатору"""

        self.window_size = window_size

    #------------------------------
    # Метод генерації сигналів
    #------------------------------

    def check_signal(self, window: pd.DataFrame) -> str:
        """
        Метод отримує через callback зріз даних і повертає стандартизований сигнал.
        Повертає: 'BUY', 'SELL', 'CLOSE' або None.
        На даному етапі — це «болванка» (шаблон).
        """

        # Поки що повертаємо None. 
        # Тут буде логіка WCE чи N-грам
        return None
